artillery.yml
config:
  target: "https://apps.powerapps.com/play/e/3ae9393f-4a41-e2c3-ba0e-11a0029cf1a3/a/e3896055-5f2f-4d3e-a38f-6596e05b0c62?tenantId=701766e0-5785-4e08-969d-87bbce0d356b&hint=5f0ae712-a9e0-40f5-b8bd-93d1a2e8f50a&sourcetime=1755792419043&source=portal"
  engines:
    playwright:
      launchOptions:
        headless: false
  processor: "./tests/commands/processor.js"

  phases:
    - name: Fixed Arrival
      duration: 20
      arrivalCount: 2

scenarios:
  - engine: playwright
    testFunction: "artilleryTest"


before:
  flow:
    - function: "beforeAll"

after:
  flow:
    - function: "cleanup"


  # Inject one user for every second for 20 seconds
  # - name: Constant Arrival
  #   duration: 20   # run for 20 seconds
  #   arrivalRate: 1  # 20 users will be created
  # # Pause
  # - name: Pause
  #   duration: 10
  # # RampUp
  # - name: RampUp
  #   duration: 30
  #   arrivalRate: 1
  #   rampTo: 2
  # # Inject 2 Users in 20 sec
  # - name: Fixed Arrival
  #   duration: 20
  #   arrivalCount: 2