artillery.yml
config:
  target: "https://emailautomationiqtech.azurewebsites.net"
  engines:
    playwright:
      launchOptions:
        headless: false
  processor: "./tests/commands/processor.js"

  phases:
    - name: Fixed Arrival
      duration: 60
      arrivalCount: 2
      phases:

scenarios:
  - engine: playwright
    testFunction: "artilleryTest"

before:
  flow:
    - function: "beforeAll"

after:
  flow:
    - function: "cleanup"


  # Inject one user for every second for 20 seconds
  # - name: Constant Arrival
  #   duration: 20   # run for 20 seconds
  #   arrivalRate: 1  # 20 users will be created
  # # Pause
  # - name: Pause
  #   duration: 10
  # # RampUp
  # - name: RampUp
  #   duration: 30
  #   arrivalRate: 1
  #   rampTo: 2
  # # Inject 2 Users in 20 sec
  # - name: Fixed Arrival
  #   duration: 20
  #   arrivalCount: 2